<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>IdPSettings</key>
			<dict>
				<key>OIDCAdminAttribute</key>
				<string>roles</string>
				<key>Provider</key>
				<string>EntraID</string>
				<key>ROPGID</key>
				<string>Insert Application ID here</string>
				<key>TenantID</key>
				<string>Insert Tenant ID here</string>
			</dict>
			<key>PayloadDescription</key>
			<string>Jamf Connect Login Settings</string>
			<key>PayloadDisplayName</key>
			<string>Jamf Connect - Menu Bar</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>6701EA0E-8FFA-4D2D-AAE4-292E4F8FEBC4</string>
			<key>PayloadOrganization</key>
			<string>ItsBlueJay</string>
			<key>PayloadType</key>
			<string>com.jamf.connect</string>
			<key>PayloadUUID</key>
			<string>275B8913-C2F9-4517-BDBF-D48D617E40AA</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>SignIn</key>
			<dict>
				<key>PasswordLabel</key>
				<string>Password</string>
				<key>UsernameLabel</key>
				<string>Email</string>
			</dict>
			<key>WebBrowser</key>
			<dict>
				<key>BrowserSelection</key>
				<string>Google Chrome</string>
			</dict>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Jamf Connect Login Settings</string>
	<key>PayloadDisplayName</key>
	<string>Jamf Connect - Menu Bar</string>
	<key>PayloadEnabled</key>
	<true/>
	<key>PayloadIdentifier</key>
	<string>6701EA0E-8FFA-4D2D-AAE4-292E4F8FEBC4</string>
	<key>PayloadOrganization</key>
	<string>ItsBlueJay</string>
	<key>PayloadRemovalDisallowed</key>
	<true/>
	<key>PayloadScope</key>
	<string>System</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>BAD3D8F2-8C18-4E2E-B403-BA10A60B3C0F</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
